{"sortTimestamp": 1677939664713, "rating": 5.0, "helpfulVotes": 0, "title": "Granddaughters love them!", "text": "I purchased several of these for my granddaughters for Xmas & they absolutely love them. In fact so do their brothers. Lol. Be aware that there are tiny magnets in them so that you can perch the ppl onto the animals & keep them there. I almost didn’t buy them bc of that given all the news stories about kids and magnets, but the magnets are INSIDE the toys. So as long as ur kids aren’t eating their toys you should be okay, but be careful around your pets so that the pets don’t try to eat them.  My grandkids adore all things Schleich as do I bc I bought it for their parents too decades ago.  Schleich is well made & lasts forever.", "images": [], "asin": "B09QH7QJS7", "verifiedPurchase": true, "parent_asin": "B09QH7QJS7", "user_id": "AFKZENTNBQ7A7V7UXW5JJI6UGRYQ"}
{"sortTimestamp": 1677939345945, "rating": 5.0, "helpfulVotes": 0, "title": "Pretty & I love it!", "text": "Lovely ink. Writes well. The right amount of wet/dry. Currently using it in both a platinum curidas (f) & a pelican twist (m) & it writes well in both.  Beautiful color & flows nicely. It has not clogged up my nibs.", "images": [], "asin": "B01AHHL4X2", "verifiedPurchase": true, "parent_asin": "B01MZ3SD2X", "user_id": "AFKZENTNBQ7A7V7UXW5JJI6UGRYQ"}
{"sortTimestamp": 1677939160682, "rating": 4.0, "helpfulVotes": 0, "title": "2 excellent 1 extremely dry (blue)", "text": "Overall I’m pretty happy with this purchase bc the ink is good & I’ve purchased it before.  The green is gorgeous.  The purple didn’t really wow me, but it flows nicely. The blue however is a disappointment bc it’s extremely dry & keeps drying in my pen. I am using the inks in the same type of pen- platinum curidas & all have same size nib. So the only difference is the actual ink.  I’m gonna try to mix a little of the ink with a tiny bit of glycerin next time I refill it & see if that helps it to stay wetter & not dry out in my pen. Aside from that I love their ink. Think I just received a dud this time with the blue.", "images": [], "asin": "B08L6H23JZ", "verifiedPurchase": true, "parent_asin": "B08L6H23JZ", "user_id": "AFKZENTNBQ7A7V7UXW5JJI6UGRYQ"}
{"sortTimestamp": 1677938767351, "rating": 3.0, "helpfulVotes": 0, "title": "Arrived Damaged : liquid in hub locker!", "text": "Unfortunately Amazon in their wisdom (cough, cough) decided to ship the snowsuit in a vinyl bag with holes in it!  There was no other bag to protect the snowsuit inside vinyl bag with all the holes.  This is what happened:  Arrived in hub locker. It was the very top locker. Opened it & pulled the pkg out getting a very wet & nasty surprise at the same time. My senses were assaulted. Smells like tea tree oil. Feels like conditioner or lotion.  I can’t understand how the delivery person a) didn’t smell that mess when they shoved the pkg in b) didn’t see the mess when they shoved it in - tho if they were short I guess that would explain it bc I’m 5’10” & I didn’t see it until the pkg was in my hands. The locker was up high & dark, but I could smell it the minute I walked into the hub locker room. I happen to be extremely allergic to tea tree oil.  It’s made from mellaleuca trees which grow all over southwest Florida where I was raised.  Tho native to Australia they were used to help drain the swamps of Florida generations ago bc they soak up so much water.  It has a very distinct smell & unfortunately is frequently used as a “carrier oil” for other oils & body lotions,  shampoos, conditioners, etc., so I have to be hyper-vigilant to avoid exposure.  Instead- Last night I got to suck down Benadryl & pray my throat didn’t close while keeping my epi-pens handy.  The liquid went through the holes & onto the snowsuit as you can clearly see in the pictures.  So I guess the suit is waterproof.  Looks true to size.  Elastic appears stretchy.  I’m super annoyed that this arrived in this condition & could have easily been avoided by amazon properly wrapping it to avoid the elements whatever they may be.", "images": [{"smallImageUrl": "https://m.media-amazon.com/images/I/710WrjJi+hL._SL256_.jpg", "mediumImageUrl": "https://m.media-amazon.com/images/I/710WrjJi+hL._SL800_.jpg", "largeImageUrl": "https://m.media-amazon.com/images/I/710WrjJi+hL._SL1600_.jpg", "attachmentType": "IMAGE"}, {"smallImageUrl": "https://m.media-amazon.com/images/I/712+yNg8COL._SL256_.jpg", "mediumImageUrl": "https://m.media-amazon.com/images/I/712+yNg8COL._SL800_.jpg", "largeImageUrl": "https://m.media-amazon.com/images/I/712+yNg8COL._SL1600_.jpg", "attachmentType": "IMAGE"}, {"smallImageUrl": "https://m.media-amazon.com/images/I/7132ByALa+L._SL256_.jpg", "mediumImageUrl": "https://m.media-amazon.com/images/I/7132ByALa+L._SL800_.jpg", "largeImageUrl": "https://m.media-amazon.com/images/I/7132ByALa+L._SL1600_.jpg", "attachmentType": "IMAGE"}, {"smallImageUrl": "https://m.media-amazon.com/images/I/718OTnxL+CL._SL256_.jpg", "mediumImageUrl": "https://m.media-amazon.com/images/I/718OTnxL+CL._SL800_.jpg", "largeImageUrl": "https://m.media-amazon.com/images/I/718OTnxL+CL._SL1600_.jpg", "attachmentType": "IMAGE"}, {"smallImageUrl": "https://m.media-amazon.com/images/I/71I6b8DyazL._SL256_.jpg", "mediumImageUrl": "https://m.media-amazon.com/images/I/71I6b8DyazL._SL800_.jpg", "largeImageUrl": "https://m.media-amazon.com/images/I/71I6b8DyazL._SL1600_.jpg", "attachmentType": "IMAGE"}, {"smallImageUrl": "https://m.media-amazon.com/images/I/71v4KKrIXuL._SL256_.jpg", "mediumImageUrl": "https://m.media-amazon.com/images/I/71v4KKrIXuL._SL800_.jpg", "largeImageUrl": "https://m.media-amazon.com/images/I/71v4KKrIXuL._SL1600_.jpg", "attachmentType": "IMAGE"}], "asin": "B096S6LZV4", "verifiedPurchase": true, "parent_asin": "B09NSZ5QMF", "user_id": "AFKZENTNBQ7A7V7UXW5JJI6UGRYQ"}
{"sortTimestamp": 1677373409298, "rating": 1.0, "helpfulVotes": 1, "title": "Received Used & scratched item! Purchased new!", "text": "Livid.  Once again received an obviously used item that has food on it & scratches. I purchased this new!!  Pics not loading rn. Will add them later. Disgusted.", "images": [], "asin": "B007WQ9YNO", "verifiedPurchase": true, "parent_asin": "B09XWYG6X1", "user_id": "AFKZENTNBQ7A7V7UXW5JJI6UGRYQ"}
{"sortTimestamp": 1677321053520, "rating": 5.0, "helpfulVotes": 8, "title": "Crazy comfy!", "text": "Not gonna lie- they are not much to look at. Lol. Luckily I’m one of those ppl that values things for function over looks & these function well so far. They are seriously one of the most comfortable pairs of socks I’ve owned in 5 decades.  I have not tried to wash them yet, so fingers crossed on that rn.  They feel very cushiony.  I wear them in my winter boots & just on my feet shoeless around my home.  I wish they came in more colors.  I’m one of those ppl that absolutely cannot stand toe seams on socks, but these have not bothered me at all.  I have super high arches so the only change I would make to the socks would be some compression there.  However, the socks fit perfectly as-is which really surprised me given my arches.  I just like having compression at my arches bc it feels good on them.  I wear a ladies 10-1/2 shoe- mens 8-1/2 and I bought the medium socks. They fit perfectly.  That’s never happened.  I had honestly expected to have to get them wet on my feet & let them shrink to fit (as they dried on my feet to my size) since they are wool. Lol. I also expected to need sock liners as I’ve had issues with wool in the past (allergies- I knit & crochet it), but I’ve not had any issues with itching luckily. Hopefully the allergy is behind me now.  This week in northern Colorado I’ve worn the socks inside my boots in minus 15 degrees & can honestly say my feet were the only warm part of my body while walking my dogs.  Seriously thinking about making mittens out of a pair bc they kept my feet so warm. Lol.  Probably the best $15 I’ve ever spent on Amazon.  These are wonderfully thick & comfy socks.  They aren’t much to look at imo, but far better than the $28 Darn socks I tried before & that was for 1 pair!", "images": [], "asin": "B07F3BDT8T", "verifiedPurchase": true, "parent_asin": "B0BGFR76CF", "user_id": "AFKZENTNBQ7A7V7UXW5JJI6UGRYQ"}
{"sortTimestamp": 1677083819242, "rating": 3.0, "helpfulVotes": 0, "title": "Useless under 40 degrees.", "text": "Useless under 40 degrees unless you’re just running to the mailbox & back & don’t mind freezing during that jog.  Zero interior pockets so nowhere to put glasses, iPhone, etc other than the 2 exterior pockets which should be larger imo as they are the only pockets.  Seems to me like they used a too large needle with the thread in mine bc it’s like the air comes through every single hole the thread is in that they used for decoration/insulation to give it a quilted effect.  With cotton fabrics you wash it & the material will shrink around the thread & you don’t have the air coming through the too large holes made by the needle.  I usually stick with the non-quilted versions of non-cotton coats fit this reason.  It looks nice, but it does not keep me warm in northern Colorado where we dip into negative temps & have crazy high winds.  I was not impressed with it. Got it in tye try before you buy program without realizing I would have to pay for bags to return the items I tried or that I would have to drop them off at ups. I’m disabled.  I don’t drive.  So fun to pay for taxis to return stuff when Amazon has a flipping hub at my apt complex.  Why can’t they make returns simpler?  Delivered to the hub & I should be able to return it to the hub imo.  Really ticks me off I don’t get anything delivered to my door anymore since moving to an apt. As a disabled person it’s a massive pain in my tush.  Every step is agony & the stuff weighs more than I am supposed to lift.  It’s a long walk when you’re in chronic pain.  Should have sent it back with the rest bc now I’ll have to pay for another $3 bag & taxis, but I wanted to try it in colder weather since it matched the color of my boots.  My bad.  Useless in cold weather.  The other issue I noticed was I tried 3 Columbia jackets in the same size (xl) bc I like to wear fleece & layers under my coats due to the temps here & the difference in sizing was ridiculous.  This was a true xl while the other two were not.  Easily managed camisole, T-shirt, & long sleeved, very thick, fleece shirt under it.  Just does not keep you warm on its own.  It’s a spring jacket imo not winter.  It has a fuzzy fur inside & I have coke to prefer fleece lined jackets bc I have service dogs & their fur is easier to get off flat fleece than fluffy fur.", "images": [], "asin": "B09KMDBDCN", "verifiedPurchase": false, "parent_asin": "B08NGL3X17", "user_id": "AFKZENTNBQ7A7V7UXW5JJI6UGRYQ"}
{"sortTimestamp": 1675529329744, "rating": 4.0, "helpfulVotes": 0, "title": "Sticky stair riser tread thingies are utterly useless.", "text": "Tried to load photos, but none of my photos or videos ever want to load on amazon. Weird huh? Bought this as “like new” from amazon. It’s not. Whoever returned it got dog hair all over the sticky stair riser treads & they will not stick to the plastic stairs so neither of my service dogs will use them although it’s identical to the last stairs we owned.  Mine is garbage bc it was previously used.", "images": [], "asin": "B084SXF9Y8", "verifiedPurchase": true, "parent_asin": "B0BHTBS5RM", "user_id": "AFKZENTNBQ7A7V7UXW5JJI6UGRYQ"}
{"sortTimestamp": 1675524098918, "rating": 4.0, "helpfulVotes": 11, "title": "Not waterproof, but a very comfy shoe.", "text": "I purchased these bc they are supposed to be waterproof. Mine are not.  Wore them in Colorado in 36 degree weather & I can feel air coming into the toe bed so my toes were cold.  Maybe they didn’t waterproof mine all the way idk or not at all bc mine are not.  I wire regular athletic socks today, but will try them again with wool socks later.  Either way they are one of the most comfy boots I have ever worn. The cushioning is magnificent. I’m disabled & have bad knees, hips, & spine & these were the most comfy shoes I’ve probably had in my life. I say that as an LL Bean, Land’s End, Merrel, Keen, & Columbia long time wearer.  I got the baby blue color for around $40 with tax which is a great deal imo.  The only big issue is I purchased them for winter walks with my dogs so they won’t work for their intended purposes. My dilemma is whether to keep them for spring boots.  The light color means they will get dirty fast so idk.  I just know they are crazy comfy & feel wonderful on my feet. I might try them with some fleece socks too & probably just spray them with boot waterproofing.  They are like a canvas tennis shoe. The material they are made out of.  So super light which I love due to my disabilities, but I don’t think I’ll be wearing these in the back country walks bc of the color I picked. Which I picked solely based on the price. I’m cost effective not cheap lol.  I admit when I got them from the amazon locker they were so incredibly light that I expected garbage.  While these are very light they are also an excellent walking boot imo tho if you need them to be waterproofed good luck bc mine are not.  If you are sticking to plowed roads & sidewalks & avoid big drifts of snow & wear a thick wool sock these will probably work very well if you’re looking for a comfy hiking boot.  Unfortunately I need something that can go off roads into the wilderness & snow drifts bc that’s where my service dogs prefer to walk. Lol.", "images": [], "asin": "B096N5WK8Q", "verifiedPurchase": true, "parent_asin": "B07RGM3DYC", "user_id": "AFKZENTNBQ7A7V7UXW5JJI6UGRYQ"}
{"sortTimestamp": 1672043410846, "rating": 5.0, "helpfulVotes": 0, "title": "Excellent for moving & storage & floods!", "text": "I purchased these for multiple reasons. The main reason was that I was moving. I was moving bc my apt kept flooding.  Luckily having been through other floods I generally store all my stuff in plastic containers anyways. Sadly a couple of my vintage Singer’s in wooden boxes had been left out during the last move & the last flood got them moldy & ruined them.  I am a bibliophile & these bags held not only huge stacks of my hardcover books, but my 40 pound Singer sewing machines. I also carried hundreds of pounds of yarn (50 per bag) and thousands of pounds of quilting fabric during my move.  It held up to paints, plants, garden pits, & pretty much anything I threw at it. I even put my pots & pans in these bags.  While I still thought they were a bit pricey I did buy some on sale & I think I bought 18 total that I was able to pack & take to my new place & unload & go pack again. Tho I now intend to leave some of my yarn in them as it’s waterproof.  Tho I intend to place it on a top shelf just to be on the safe side. Lol. Not one bag ripped, tore, or had an issue so far that I am aware of tho I have not checked them over very well. And I had no issues with the zippers tho I am positive that I packed several bags well over the weight limit on accident bc I was trying to keep certain quilting fabrics together for a quilt project.  I’ve bought some real duds on Amazon, but this was not one of them. This has by far been one of my better purchases & I’ve told my kids that are planning to move to buy the bags too bc it is just so much easier imo.  I literally used a taxi to move half my stuff (disabled & don’t drive) & was able to fold the bags back down to how they arrived after unpacking to take them back to be packed again.  I also made little tags and used color coded handkerchiefs I hung on the handles so I knew which room the bags went in or knew what was in them without having to open them in the wrong room once I moved.  It saved time.  I live in an apt & these bags take up a lot less space than the massive sterling & Rubbermaid hard sided plastic totes I normally use for moving & craft storage.  I still have them & use them, but storing them is a challenge.  Also, the bags fit under my zinus/spa sensations type elevated platform bed. It’s a frame amazon sells & you buy your own mattress. Normally I can fit 8 hard sided tubs under my bed (queen bed), but I’m limited by the height of the tubs. The bags fit or I’m able to squish to fit if I overfill them which is nice.  Depending on how full you pack them you can get 4-8. They are different sizes than my plastic tubs tho.  I only wish I had stumbled across these bags years ago given how many times I’ve moved. Lol.", "images": [], "asin": "B09H2VJW6K", "verifiedPurchase": true, "parent_asin": "B0BXDLF8TW", "user_id": "AFKZENTNBQ7A7V7UXW5JJI6UGRYQ"}
